IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_adc_regs.xml
	<register id="ADCSOCFLG1" width="16" page="1" offset="0xc" internal="0" description="ADC SOC Flag 1 Register">
		<bitfield id="SOC0" description="SOC0 Start of Conversion Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOC1" description="SOC1 Start of Conversion Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SOC2" description="SOC2 Start of Conversion Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOC3" description="SOC3 Start of Conversion Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SOC4" description="SOC4 Start of Conversion Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SOC5" description="SOC5 Start of Conversion Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SOC6" description="SOC6 Start of Conversion Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SOC7" description="SOC7 Start of Conversion Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SOC8" description="SOC8 Start of Conversion Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SOC9" description="SOC9 Start of Conversion Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SOC10" description="SOC10 Start of Conversion Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SOC11" description="SOC11 Start of Conversion Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC12" description="SOC12 Start of Conversion Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SOC13" description="SOC13 Start of Conversion Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SOC14" description="SOC14 Start of Conversion Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SOC15" description="SOC15 Start of Conversion Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="ADCSOCFRC1" width="16" page="1" offset="0xd" internal="0" description="ADC SOC Force 1 Register">
		<bitfield id="SOC0" description="SOC0 Force Start of Conversion Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 Force Start of Conversion Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 Force Start of Conversion Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 Force Start of Conversion Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 Force Start of Conversion Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 Force Start of Conversion Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 Force Start of Conversion Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 Force Start of Conversion Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 Force Start of Conversion Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 Force Start of Conversion Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 Force Start of Conversion Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 Force Start of Conversion Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 Force Start of Conversion Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 Force Start of Conversion Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 Force Start of Conversion Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 Force Start of Conversion Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCOVF1" width="16" page="1" offset="0xe" internal="0" description="ADC SOC Overflow 1 Register">
		<bitfield id="SOC0" description="SOC0 Start of Conversion Overflow Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOC1" description="SOC1 Start of Conversion Overflow Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SOC2" description="SOC2 Start of Conversion Overflow Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOC3" description="SOC3 Start of Conversion Overflow Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SOC4" description="SOC4 Start of Conversion Overflow Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SOC5" description="SOC5 Start of Conversion Overflow Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SOC6" description="SOC6 Start of Conversion Overflow Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SOC7" description="SOC7 Start of Conversion Overflow Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SOC8" description="SOC8 Start of Conversion Overflow Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SOC9" description="SOC9 Start of Conversion Overflow Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SOC10" description="SOC10 Start of Conversion Overflow Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SOC11" description="SOC11 Start of Conversion Overflow Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC12" description="SOC12 Start of Conversion Overflow Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SOC13" description="SOC13 Start of Conversion Overflow Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SOC14" description="SOC14 Start of Conversion Overflow Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SOC15" description="SOC15 Start of Conversion Overflow Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="ADCSOCOVFCLR1" width="16" page="1" offset="0xf" internal="0" description="ADC SOC Overflow Clear 1 Register">
		<bitfield id="SOC0" description="SOC0 Clear Start of Conversion Overflow Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 Clear Start of Conversion Overflow Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 Clear Start of Conversion Overflow Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 Clear Start of Conversion Overflow Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 Clear Start of Conversion Overflow Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 Clear Start of Conversion Overflow Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 Clear Start of Conversion Overflow Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 Clear Start of Conversion Overflow Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 Clear Start of Conversion Overflow Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 Clear Start of Conversion Overflow Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 Clear Start of Conversion Overflow Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 Clear Start of Conversion Overflow Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 Clear Start of Conversion Overflow Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 Clear Start of Conversion Overflow Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 Clear Start of Conversion Overflow Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 Clear Start of Conversion Overflow Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOC0CTL" width="32" page="1" offset="0x10" internal="0" description="ADC SOC0 Control Register">
		<bitfield id="ACQPS" description="SOC0 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC0 Channel Select" begin="18" end="15" width="4" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC0 Trigger Source Select" begin="25" end="20" width="6" rwaccess="RW"/>
	</register>
